benchmarks/definitive_results/replication/time_wise/opt-1.3b/_96__4/log_16292127.out
WARNING 03-04 15:19:44 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', host='localhost', port=2774, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/ShareGPT_V3_unfiltered_cleaned_split.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b/', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=50, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='benchmarks/definitive_results/replication/time_wise/opt-1.3b/_96__4', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--disable-log-requests --disable-log-stats --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b/ --max-model-len=2048 --max-num-seqs=96', multiple_servers=4, launch_server_with_nsight=False, disable_log_stats=True, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, include_nvtx_regions=True)
Servers started
Requests to servers. Values: ['http://localhost:2774/v1/completions'
 'http://localhost:2775/v1/completions'
 'http://localhost:2776/v1/completions'
 'http://localhost:2777/v1/completions']. Counts: [13 13 12 12]
Starting initial single prompt test run for url http://localhost:2776/v1/completions
Initial test run completed. Starting main benchmark run...
Starting initial single prompt test run for url http://localhost:2777/v1/completions
Initial test run completed. Starting main benchmark run...
Starting initial single prompt test run for url http://localhost:2775/v1/completions
Initial test run completed. Starting main benchmark run...
Starting initial single prompt test run for url http://localhost:2774/v1/completions
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     50        
Benchmark duration (s):                  15.32     
Total input tokens:                      8886      
Total generated tokens:                  16323     
Request throughput (req/s):              3.26      
Output token throughput (tok/s):         1065.30   
Total Token throughput (tok/s):          1645.24   
---------------Time to First Token----------------
Mean TTFT (ms):                          145.98    
Median TTFT (ms):                        152.99    
P99 TTFT (ms):                           173.94    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.38     
Median TPOT (ms):                        17.23     
P99 TPOT (ms):                           20.50     
---------------Inter-token Latency----------------
Mean ITL (ms):                           17.14     
Median ITL (ms):                         17.06     
P99 ITL (ms):                            33.75     
==================================================
Servers terminated
Hint: CUDA_VISIBLE_DEVICES is set. You may want to use '--gpu-metrics-devices=cuda-visible' instead of '--gpu-metrics-devices=all'
GPU 0: General Metrics for NVIDIA GH100 (any frequency)
Collecting data...
Generating '/scratch/tmp/16292127/nsys-report-7a2a.qdstrm'
[1/1] [========================100%] .nsys-rep
Generated:
    /home/bsc/bsc098069/llm_benchmarking/vLLMServingPlateau/benchmarks/definitive_results/replication/time_wise/opt-1.3b/_96__4/.nsys-rep